In [ ]:
# Q1 Easy
# Count from table for two different things.
# Use filter or use subquery or use sum & case

In [ ]:
# SELECT 
#   COUNT(*) FILTER (WHERE device_type = 'laptop') AS laptop_views,
#   COUNT(*) FILTER (WHERE device_type IN ('tablet', 'phone'))  AS mobile_views 
# FROM viewership;

In [ ]:
# SELECT 
#   SUM(CASE WHEN device_type = 'laptop' THEN 1 ELSE 0 END) AS laptop_views, 
#   SUM(CASE WHEN device_type IN ('tablet', 'phone') THEN 1 ELSE 0 END) AS mobile_views 
# FROM viewership;

In [ ]:
# select 
# (sELECT count(*) as laptop_views FROM viewership
# WHERE device_type = 'laptop') as laptop_views,
# (SELECT count(*) as mobile_views FROM viewership
# WHERE device_type = 'tablet' or device_type ='phone') as mobile_views;

![Alt text](image.png)

![Alt text](image-1.png)

In [ ]:
# Q2
# we can use count in having without using it in select

![Alt text](image-6.png)

![Alt text](image-3.png)

In [ ]:
# Q 3
# left join to find A-B that is entries in a not present in break
# use b.key  is null in where

![Alt text](image-4.png)

In [ ]:
# SELECT p.page_id FROM pages as p
# LEFT JOIN page_likes as pl
# on pl.page_id = p.page_id
# where pl.page_id is null
# order by p.page_id;

In [ ]:
# SELECT page_id
# FROM pages
# EXCEPT
# SELECT page_id
# FROM page_likes;

In [ ]:
# SELECT page_id
# FROM pages
# WHERE page_id NOT IN (
#   SELECT page_id
#   FROM page_likes
#   WHERE page_id IS NOT NULL

In [ ]:
# SELECT page_id
# FROM pages
# WHERE NOT EXISTS (
#   SELECT page_id
#   FROM page_likes AS likes
#   WHERE likes.page_id = pages.page_id
# ;)

In [ ]:
# # Q how to use subquery in from
# Note we cans use same column name

![Alt text](image-5.png)

In [ ]:
# SELECT 
#   tweet_count_per_user AS tweet_bucket, 
#   COUNT(user_id) AS users_num 
# FROM (
#   SELECT 
#     user_id, 
#     COUNT(tweet_id) AS tweet_count_per_user 
#   FROM tweets 
#   WHERE tweet_date BETWEEN '2022-01-01' 
#     AND '2022-12-31'
#   GROUP BY user_id) AS total_tweets 
# GROUP BY tweet_count_per_user;

In [1]:
# extract month

![Alt text](image-7.png)

In [ ]:
# LIKE and other operators

![Alt text](image-8.png)

![Alt text](image-10.png)

In [ ]:
# HAVING

In [ ]:
# # # HAVING VS WHERE
# # we can having having avg() without having that column in select
# In SQL, HAVING can be used to filter aggregated data using multiple conditions, just in the same way WHERE can filter data with multiple conditions.

![Alt text](image-11.png)

In [ ]:
# Can HAVING be used without GROUP BY?
# It's technically possible to have HAVING without GROUP BY in SQL, and in this case HAVING operates the same as WHERE. However, practically speaking, it's super weird to use HAVING in this context. For the most part, you should just use a WHERE clause if trying to filter on non-aggregated values.

In [ ]:
# DISTINCT

In [ ]:
# SELECT DISTINCT manufacturer
# FROM pharmacy_sales;

#VIMP ***

# DISTINCT With Two Columns
# If you include two (or more) columns in a SELECT DISTINCT clause, your results will contain all of the unique pairs of those two columns.

In [ ]:
# You can use DISTINCT with aggregate functions â€“ the most common one being COUNT. Here's an example that finds the number of unique user's who made trades:

# SELECT COUNT(DISTINCT user_id) 
# FROM trades;

![Alt text](image-13.png)

In [ ]:
# ARITHMATIC

In [ ]:
# In addition to querying raw data with SQL, you can also use math expressions to transform column values. Here's an example:

# SELECT particle_speed / 10.0 + speed_offset
# FROM particle_sensor_data
# WHERE (particle_position ^ 2) * 10.0 > 500
# AND sensor_type = 'photon'
# AND measurement_day %  7 = 0;
# Let's dive into each arithmetic operator, one by one.

# SQL Arithmetic Operators
# SQL Addition +
# The + operator adds two numbers.

# SELECT salary + bonus AS total_compensation FROM employees;
# SQL Subtraction -
# The - operator subtracts one column value from another.

# SELECT revenue - expenses AS profit FROM product_sales;
# SQL Multiplication *
# The * operator multiplies two numbers.

# SELECT units_sold * price AS revenue FROM ecomm_orders;
# Note: this is exactly the same * as SELECT * FROM table_name... so don't get confused by *'s two uses!!

# SQL Division /
# The / operator divides the first column value by the number in the 2nd column.

# SELECT country_gdp / population AS gdp_per_capita FROM econ_stats;

![Alt text](image-14.png)

In [ ]:
# Example of having min - max in select using group by..if we use group by min and max operates at group by level

![Alt text](image-15.png)

In [ ]:
# # In below note
# we use where as filter is at row level
# we cannot use alias in where as where gets evaluated first

![Alt text](image-16.png)

In [ ]:
# MATHEMTETCIAL FUNCTIONS

In [ ]:
# ABS(): Calculating Absolute Differences

In [ ]:
# SELECT 
#   date, 
#   ticker,
#   (close-open) AS difference,
#   ABS(close-open) AS abs_difference
# FROM stock_prices
# WHERE EXTRACT(YEAR FROM date) = 2023
#   AND ticker = 'GOOG';

In [ ]:
# ROUND(): Rounding Numbers
# Consider a scenario where you're compiling a report displaying the average closing prices of Apple's stock (ticker: 'AAPL') throughout 2022. To ensure the report's readability, you decide to round the average prices to 2 decimal places.

In [ ]:
# SELECT 
#   ticker,
#   AVG(close) AS avg_close,
#   ROUND(AVG(close), 2) AS rounded_avg_close
# FROM stock_prices
# WHERE EXTRACT(YEAR FROM date) = 2022
# GROUP BY ticker;

In [ ]:
# CEIL() and FLOOR(): Rounding Up and Down
# Now, imagine you're analyzing Facebook's stock performance (ticker: 'META') to identify potential trading ranges.

# We can utilize the CEIL() function to round up and the FLOOR() function to round down to the lowest and highest prices.

# SELECT 
#   date,
#   ticker,
#   high,
#   CEIL(high) AS resistance_level,
#   low,
#   FLOOR(low) AS support_level
# FROM stock_prices
# WHERE ticker = 'META'
# ORDER BY date;

In [ ]:
# POWER(): Calculating Squared Values
# In this scenario, we'll explore the concept of squared values by focusing on the 3 popular tech stocks: Apple ('AAPL'), Google ('GOOG'), and Microsoft ('MSFT'). Although this scenario is simplified for illustrative purposes, it offers a straightforward way to introduce the usage of the POWER() function.

# The POWER() function raises a number to a specified power, allowing us to perform exponential calculations.

# SELECT 
#   date,
#   ticker,
#   close,
#   ROUND(POWER(close, 2),2) AS squared_close
# FROM stock_prices
# WHERE ticker IN ('AAPL', 'GOOG', 'MSFT')
# ORDER BY date;

In [ ]:
# DIVISION

In [ ]:
# # VERY IMP
# n SQL, the division operator / treats integers (whole numbers like 1, -69, 420) differently than in Excel. In SQL, integer division discards the remainder from the output, providing only the integer (whole number) part of the result. This behavior contrasts with Excel, which retains the decimal part.

In [ ]:
# You can still make SQL achieve decimal output with a few tricks such as:

# CAST() function
# multiplying by 1.0
# being explicit with types using ::

In [ ]:
# SELECT 
#   CAST(10 AS DECIMAL)/4,
#   CAST(10 AS FLOAT)/4,
#   10/CAST(6 AS DECIMAL),
#   10/CAST(6 AS FLOAT);

In [ ]:
# SELECT 
#   10/6,
#   10*1.0/6,
#   10/6*1.0,
#   10/(6*1.0);

In [ ]:
# SELECT 
#   10::DECIMAL/4,
#   10::FLOAT/4,
#   10/4::DECIMAL,
#   10/4::FLOAT,
#   10::DECIMAL/6,
#   10::FLOAT/6;

In [ ]:
# Good question

![Alt text](image-18.png)

![Alt text](image-17.png)

In [ ]:
# HANDLING NULLS

In [ ]:
# FOR NULL CHECK ALWAYS USE IS NULL OR IS NOT NULL

# NULL ARE SORTED AT TOP

![Alt text](image-19.png)

In [ ]:
# Difference between COALESCE() and IFNULL()
# While both the COALESCE() and IFNULL() functions serve a similar purpose of handling NULL values, there is a key difference between them.

# COALESCE() Function: Versatile for multiple arguments, it returns the first non-null value among them.

# COALESCE(arg1, arg2, arg3, ...)
# IFNULL() Function: Handles two arguments, returning the second if the first is null; else, it returns the first.

# IFNULL(expression, value_if_null)

In [ ]:
# Example

# Suppose you have these values:

# arg1 is NULL
# arg2 is 5
# arg3 is 10
# With COALESCE(arg1, arg2, arg3), the result would be 5 (the first non-null value). However, if arg2 is NULL, then the result would be 10 (the first non-null value).

# With IFNULL(arg1, arg2), the result would be 5 (since arg1 is NULL, it returns the second argument, which is 5).

# So, while they both can serve similar purposes,

# COALESCE() offers more flexibility when dealing with multiple values,
# Whereas IFNULL() is a more concise option when you have two values to work with.

In [ ]:
# CASE STATMENT

In [ ]:
# SELECT
#   CASE 
#     WHEN condition_1 THEN result_1
#     WHEN condition_2 THEN result_2
#     WHEN ... THEN ...
#     ELSE result_3 -- If no condition matches, return the result in ELSE clause
#   END AS new_column_name -- Give your new column an alias here

In [ ]:
# SQL JOINS

In [ ]:
# 4 Types of SQL Joins
# So far in this tutorial, we've simply use the JOIN keyword, which is short for an INNER JOIN. There's actually 4 different types of JOINS in SQL, which we'll now cover in detail.

# Type of Joins	Description
# INNER JOIN	Returns only the rows with matching values from both tables.
# LEFT JOIN	Returns all the rows from the left table and the matching rows from the right table.
# RIGHT JOIN	Returns all the rows from the right table and the matching rows from the left table.
# FULL OUTER JOIN	Returns all rows when there is a match in either the left or the right table. If there is no match, NULL values are returned for columns from the

![Alt text](image-20.png)

In [ ]:
# SELECT
# 	CONCAT ('CONCAT',' ', 'function');

In [ ]:
# Introduction to PostgreSQL CONCAT function
# To concatenate two or more strings into one, you use the string concatenation operator || as the following example:

# SELECT
#    'Concatenation' || ' ' || 'Operator' AS result_string;

In [ ]:
# DATE

In [ ]:
# CURRENT_DATE, CURRENT_TIME and CURRENT TIMESTAMP to return current date and time.
# EXTRACT() and DATE_PART() to extract specific components of date.
# DATE_TRUNC() to round down date or timestamp into specific level of precision.
# INTERVAL to add or subtract time intervals in calculations.
# TO_CHAR() to convert date or timestamp into strings.
# ::DATE, TO_DATE(), ::TIMESTAMP, and TO_TIMESTAMP() to convert strings into date or timestamp.

In [ ]:
# Getting the Current Date and Time in SQL
# If you want to find out the current date and time, here's the functions that you can use:

# CURRENT_DATE: Returns the current date.
# CURRENT_TIME: Returns the current time without the date.
# CURRENT_TIMESTAMP (or NOW()): Returns the current date and time.
# Let's apply these functions onto the messages table:

# SELECT 
#   message_id,
#   sent_date,
#   CURRENT_DATE AS current_date,
#   CURRENT_TIME AS current_time,
#   CURRENT_TIMESTAMP AS current_timestamp
# FROM messages
# LIMIT 3;

In [ ]:
# Extracting Parts from Dates in SQL
# This is pretty straightforward! ðŸ˜‰ The EXTRACT() function extracts a specific component (i.e. year, month, day, hour, or minute) from a date or timestamp. You can also use DATE_PART() for the same purpose.

# SELECT 
#   message_id, 
#   sent_date,
#   EXTRACT(YEAR FROM sent_date) AS extracted_year,
#   DATE_PART('year', sent_date) AS part_year,
#   EXTRACT(MONTH FROM sent_date) AS extracted_month,
#   DATE_PART('month', sent_date) AS part_month,
#   EXTRACT(DAY FROM sent_date) AS extracted_day,
#   DATE_PART('day', sent_date) AS part_day,
#   EXTRACT(HOUR FROM sent_date) AS extracted_hour,
#   DATE_PART('hour', sent_date) AS part_hour,
#   EXTRACT(MINUTE FROM sent_date) AS extracted_minute,
#   DATE_PART('minute', sent_date) AS part_minute
# FROM messages
# LIMIT 3;

In [ ]:
# Truncating Date and Time in SQL
# The DATE_TRUNC() rounds down a date or timestamp to a specified unit of time. In other words, it trims the finer details and retains the specified unit.

# SELECT 
#   message_id,
#   sent_date,
#   DATE_TRUNC('month', sent_date) AS truncated_to_month,
#   DATE_TRUNC('day', sent_date) AS truncated_to_day,
#   DATE_TRUNC('hour', sent_date) AS truncated_to_hour  
# FROM messages
# LIMIT 3;
# Here's what's happening in the results:

# truncated_to_month: It rounds down the date to the beginning of the month. For example, if a message was sent on August 3rd, 2022 at 16:43, it's snapped to August 1st, 2022, while retaining the year and month.
# truncated_to_day: It rounds down the date to the beginning of the day. The same August 3rd message becomes August 3rd, 2022, with the hour, minute, and seconds set to zero.
# truncated_to_hour: It rounds down the time to the beginning of the hour. The message becomes August 3rd, 2022 at 16:00, with the minutes and seconds set to zero.

In [ ]:
# Adding and Subtracting Intervals in SQL
# The INTERVAL function is used to handle date and time gaps by adding and subtracting intervals such as "3 days", "5 hours", "45 minutes".

# SELECT 
#   message_id,
#   sent_date,
#   sent_date + INTERVAL '2 days' AS add_2days,
#   sent_date - INTERVAL '3 days' AS minus_3days,
#   sent_date + INTERVAL '2 hours' AS add_2hours,
#   sent_date - INTERVAL '10 minutes' AS minus_10mins
# FROM messages
# LIMIT 3;

In [ ]:
# Formatting Dates in SQL
# TO_CHAR() converts a date or timestamp to a string with a specified format.

In [ ]:
# SELECT 
#   message_id,
#   sent_date,
#   TO_CHAR(sent_date, 'YYYY-MM-DD HH:MI:SS') AS formatted_iso8601,
#   TO_CHAR(sent_date, 'YYYY-MM-DD HH:MI:SS AM') AS formatted_12hr,
#   TO_CHAR(sent_date, 'Month DDth, YYYY') AS formatted_longmonth,
#   TO_CHAR(sent_date, 'Mon DD, YYYY') AS formatted_shortmonth,
#   TO_CHAR(sent_date, 'DD Month YYYY') AS formatted_daymonthyear,
#   TO_CHAR(sent_date, 'Month') AS formatted_dayofmonth,
#   TO_CHAR(sent_date, 'Day') AS formatted_dayofweek
# FROM messages
# LIMIT 3;

In [ ]:
# You can use casting for date and timestamp data too! If you encounter date or timestamp data that's formatted as strings, here's two SQL functions that can help:

# ::DATE or TO_DATE(): Convert strings into dates.
# ::TIMESTAMP or TO_TIMESTAMP(): Convert strings into timestamps.
# SELECT 
#   sent_date,
#   sent_date::DATE AS casted_date,
#   TO_DATE('2023-08-27', 'YYYY-MM-DD') AS converted_to_date,
#   sent_date::TIMESTAMP AS casted_timestamp,
#   TO_TIMESTAMP('2023-08-27 10:30:00', 'YYYY-MM-DD HH:MI:SS') AS converted_to_timestamp
# FROM messages
# LIMIT 3;

In [ ]:
# VIMP
# difference between two dates is interval 
# while comparing use '1 days'
# see below where clase

![Alt text](image-22.png)

![Alt text](image-21.png)

In [ ]:
# DATE()
# Extracts the date part of a date or date/time expression. Example: For the below table named â€˜Testâ€™

# Id	Name	BirthTime
# 4120	Pratik	1996-09-26 16:44:15.581
# Query:

# SELECT Name, DATE(BirthTime) 
# AS BirthDate FROM Test;

In [ ]:
# DATEDIFF()
#  Returns the number of days between two dates. 

# Syntax:

# DATEDIFF(date1, date2);

# date1 & date2- date/time expression

In [ ]:
# DATE_ADD() 
#  Adds a specified time interval to a date.

# Syntax:

# DATE_ADD(date, INTERVAL expr type);

# Where,  date â€“ valid date expression, and expr is the number of intervals we want to add. and type can be one of the following: MICROSECOND, SECOND, MINUTE, HOUR, DAY, WEEK, MONTH, QUARTER, YEAR, etc. Example: For the below table named â€˜Testâ€™

# Id	Name	BirthTime
# 4120	Pratik	1996-09-26 16:44:15.581
# Query:
# SELECT Name, DATE_ADD(BirthTime, INTERVAL 
# 1 YEAR) AS BirthTimeModified FROM Test;